// TinySegmenter 0.1 -- Super compact Japanese tokenizer in Javascript
// (c) 2008 Taku Kudo <taku@chasen.org>
// TinySegmenter is freely distributable under the terms of a new BSD licence.
// For details, see http://chasen.org/~taku/software/TinySegmenter/LICENCE.txt

var default_model = {
  BC1: {
    IH: -849,
    II: 1837,
    IK: -713,
    IO: 1253,
    KK: 89,
    MH: 2307,
    NH: 3896,
    OI: -853,
    OO: 2103,
  },
  BC2: {
    AA: -13455,
    HH: -8979,
    HI: -5757,
    HO: 3820,
    IH: -189,
    II: -10842,
    IO: 5698,
    KI: 1519,
    KK: -17877,
    KO: -2190,
    MH: -278,
    NH: 2304,
    NN: -17353,
    OH: 2160,
    OO: -11122,
  },
  BC3: { HH: 394, HI: 150, HO: -173, II: 464, KK: 3556, OA: -546 },
  BIAS: 5307,
  BP1: { OB: -128, UB: 100, UO: -132 },
  BP2: { BB: 899, BO: 2558, OB: -191, OO: 538, UB: 307 },
  BQ1: { OHI: 44, UKK: 248, UOH: -530, UOO: 350 },
  BQ2: {
    BIH: -1217,
    BII: -99,
    BKK: -74,
    OAA: -1996,
    OHH: -438,
    OHI: -139,
    OIH: 318,
    OKI: 196,
    OOO: -1110,
    UIH: -363,
    UII: -668,
    UKI: -908,
  },
  BQ3: {
    BAA: 943,
    BHH: -983,
    BKH: -92,
    BMH: 434,
    OHH: 2804,
    OII: 105,
    OKK: 764,
    UOI: -299,
    UOO: 576,
  },
  BQ4: {
    BHH: -634,
    BIH: 1248,
    BII: -513,
    BKK: -1093,
    BOO: -1190,
    OAA: -2466,
    OHH: 547,
    OIH: -1465,
    OII: 493,
  },
  BW1: {
    から: 4419,
    した: 188,
    そう: 329,
    こと: 379,
    いい: 493,
    った: 2678,
    つい: -1724,
    てく: -967,
    です: 3443,
    とか: 1047,
    どこ: 662,
    ない: 6127,
    なっ: 569,
    なん: -1631,
    んな: 700,
    んだ: 924,
    B1お: 2961,
  },
  BW2: {
    "()": -2075,
    "..": -7888,
    くだ: -926,
    かも: -667,
    から: -3221,
    けど: -6810,
    しか: -1159,
    した: 1024,
    しい: -2852,
    すぎ: -1013,
    その: -370,
    ただ: -760,
    たら: -1593,
    たん: 336,
    おめ: 1524,
    こと: -2678,
    この: -2323,
    され: 8465,
    さん: -868,
    お前: -1607,
    いい: -474,
    いう: -1770,
    いや: -182,
    うか: 46,
    った: 4285,
    って: -1433,
    てき: 1281,
    てく: 1950,
    てる: -1190,
    です: -7815,
    でも: -273,
    とい: 1853,
    とか: -2940,
    ない: -3968,
    なの: 876,
    なん: 2950,
    にし: 139,
    に対: -1204,
    に関: -1108,
    のか: 4539,
    ので: -6044,
    のに: -3575,
    ます: -45,
    まで: -1683,
    もの: -3342,
    わか: -2151,
    われ: 1381,
    らん: 565,
    んな: -6352,
    んと: -91,
    んだ: 4222,
    ろう: 2026,
  },
  BW3: {
    ")E1": -422,
    いE1: -2482,
    かっ: -2809,
    から: 2648,
    けど: 10648,
    じゃ: 2959,
    "か？": 437,
    しい: -6268,
    すぎ: 3755,
    する: 1043,
    そう: 880,
    たE1: 1287,
    たい: -3040,
    かE1: 2266,
    こと: 3888,
    この: 230,
    さい: -3428,
    いい: 6897,
    いる: 4866,
    っけ: 1411,
    った: -7055,
    てた: 2105,
    てる: 1944,
    です: 1628,
    とう: -1881,
    と思: 3190,
    どう: 888,
    なE1: 1403,
    ない: 2515,
    にな: 92,
    まし: 624,
    ます: 3290,
    まっ: -876,
    まで: 2234,
    わか: 1880,
    よう: -2952,
    らし: 1376,
    られ: 520,
    れて: 392,
    わE1: 45,
    んだ: 4151,
    んで: 332,
    よE1: 140,
    "？E1": 490,
  },
  TC1: { AAA: 4169, III: 285, NNH: 386, OOO: 1196 },
  TC2: { HII: 415, IHI: -91, III: -647, OHH: -472 },
  TC3: {
    HII: -1781,
    HIO: -199,
    IHI: -2422,
    IIH: -2503,
    IIK: -263,
    IIO: 1331,
    IKK: 1467,
    KKH: -45,
    KOK: -2833,
  },
  TC4: {
    AAA: 1095,
    HHH: -362,
    HHO: 1076,
    HII: 330,
    IHI: -253,
    IIO: 290,
    IOO: 103,
    KKK: 81,
    OAA: -1734,
  },
  TQ1: { BAAA: 2559, BIII: 446, OHII: 1455, OIII: -102, OKKK: 113 },
  TQ2: { OHHH: -480, OIHI: -100, OIII: -98, UKKK: 504, UOHH: -943 },
  TQ3: { BIHI: 451, OHHH: 726, OHHI: 211, OHII: 997, OKKK: 899, OOII: -1057 },
  TQ4: {
    BAAA: 1276,
    BHIH: 416,
    BHII: -809,
    BIII: -1005,
    OAAA: -1764,
    OHHI: 280,
    OHIH: -7569,
    OHII: 1002,
    OIHI: -523,
    OIII: -778,
    OKKO: -990,
    OKOK: -4225,
    OOOO: -690,
  },
  TW1: { ありが: -3526 },
  TW2: {
    ありが: -3721,
    ってな: -3003,
    として: -184,
    なるほ: -515,
    やる気: -2903,
  },
  TW3: { "()E1": -2223, てなん: -466 },
  TW4: {
    かった: -2521,
    ってる: -1792,
    てない: 527,
    ました: 1640,
    らしい: 1934,
    んです: 1685,
  },
  UC1: { K: 106, O: -150 },
  UC2: { H: 1754, I: -432, N: 1059, O: -1101 },
  UC3: { I: 2022, K: -538, M: -4130, N: 2215, O: 637 },
  UC4: { K: -1262, O: 1714 },
  UC5: { H: 1329, I: 265, O: -683 },
  UC6: { H: -501, K: -87, O: 64 },
  UP1: { B: 92, O: -95 },
  UP2: { O: 861 },
  UP3: { B: 168 },
  UQ1: { BH: 60, BI: -40, OI: 145, OO: -651, UI: -102, UK: 47, UO: 335 },
  UQ2: { BI: -544, OK: 687 },
  UQ3: { BH: -1585, BI: 391, BO: 4870, OI: 97, OK: 400, OO: -2196 },
  UW1: {
    う: 375,
    が: -46,
    こ: 190,
    ち: -473,
    っ: 199,
    は: -104,
    わ: 249,
    ク: 191,
    B1: 1818,
    a: 976,
    i: 237,
  },
  UW2: {
    あ: -104,
    い: 410,
    え: 665,
    か: 340,
    が: -1128,
    け: 1986,
    こ: 811,
    し: 944,
    せ: 802,
    そ: -506,
    だ: 832,
    っ: 1482,
    と: -612,
    ど: -242,
    に: -517,
    の: 288,
    は: -806,
    ま: 2002,
    ー: 675,
    め: -45,
    も: -1133,
    り: -1350,
    る: 150,
    れ: 1194,
    を: -1634,
    ん: 1249,
    初: -781,
    大: -1785,
    日: -523,
    本: -948,
    見: -905,
    間: -1482,
  },
  UW3: {
    ")": -877,
    ".": -1201,
    "…": 2055,
    "、": 3062,
    あ: -2205,
    い: 517,
    う: 2794,
    え: 1740,
    お: -4473,
    が: 3478,
    き: 147,
    く: -51,
    こ: -2509,
    ご: -597,
    す: -777,
    せ: 1841,
    そ: -4267,
    た: 1968,
    だ: 2188,
    っ: -1322,
    て: 5381,
    で: 977,
    と: 51,
    ど: -1050,
    な: -2313,
    に: 3065,
    ね: -91,
    の: 3712,
    は: 3618,
    ほ: -992,
    ま: -5229,
    み: -1786,
    ン: 148,
    め: -150,
    も: 973,
    や: -701,
    ら: 1166,
    る: 4747,
    れ: 3285,
    わ: -1493,
    を: 3868,
    ん: 804,
    一: -549,
    今: 2150,
    人: 4244,
    俺: 8238,
    何: 4912,
    前: 2954,
    史: 1063,
    大: 511,
    学: -680,
    少: -1182,
    当: -5087,
    数: 484,
    方: 1307,
    日: 741,
    言: -526,
    誰: 2875,
    違: -1133,
    e: 1135,
  },
  UW4: {
    "(": -94,
    "、": 1050,
    あ: 3209,
    い: -4562,
    う: -2024,
    え: -3197,
    お: 3251,
    か: 261,
    が: 5067,
    き: -3424,
    ぎ: -1465,
    く: -3180,
    け: -4611,
    げ: -184,
    こ: 591,
    し: -199,
    せ: -292,
    そ: 3588,
    た: 6362,
    だ: 4957,
    ち: -810,
    っ: -2653,
    つ: -772,
    て: 4402,
    で: 4703,
    と: 2147,
    な: 5143,
    に: 3942,
    ね: 6166,
    の: 6890,
    は: 8195,
    ば: 141,
    ふ: 524,
    ま: 1613,
    み: -416,
    ホ: 91,
    ン: -2060,
    ー: -6477,
    め: -1222,
    も: 2135,
    ゃ: -5973,
    や: 3610,
    ょ: -938,
    よ: 3049,
    ら: -5506,
    り: -8440,
    る: -12969,
    れ: -3862,
    ろ: -7384,
    を: 8410,
    ん: -2196,
    前: -95,
    夫: -1806,
    日: -1386,
    生: -1103,
    見: 1039,
    間: -1583,
    "！": 1857,
    "？": 1468,
    ｗ: 138,
    ｯ: -2414,
    0: -377,
    y: 1009,
  },
  UW5: {
    "、": -811,
    え: 1020,
    か: 434,
    が: -808,
    き: 2122,
    ぎ: 851,
    く: 296,
    け: 2189,
    さ: -628,
    し: -258,
    す: 1190,
    た: 45,
    だ: -903,
    っ: 1276,
    つ: 1810,
    て: -120,
    で: -806,
    と: -613,
    な: -924,
    に: -2014,
    の: -881,
    は: -209,
    ば: -187,
    ー: 2102,
    ゃ: 2125,
    ら: 1213,
    り: -715,
    る: 1858,
    れ: 1982,
    わ: 190,
    を: -400,
    ん: 92,
    イ: 502,
  },
  UW6: {
    い: 313,
    う: -405,
    が: 417,
    き: -428,
    さ: 297,
    す: 95,
    っ: 114,
    て: -331,
    で: 106,
    な: 249,
    に: -360,
    "？": 261,
    E1: 102,
  },
};
export default function TinySegmenter(model?) {
  this.model = model || default_model;
}

var patterns = {
  "[一二三四五六七八九十百千万億兆]": "M",
  "[一-龠々〆ヵヶ]": "H",
  "[ぁ-ん]": "I",
  "[ァ-ヴーｱ-ﾝﾞｰ]": "K",
  "[a-zA-Zａ-ｚＡ-Ｚ]": "A",
  "[0-9０-９]": "N",
};
var chartype = [];
for (var i in patterns) {
  var regexp = new RegExp(i);
  chartype.push([regexp, patterns[i]]);
}

function getctype(str) {
  for (var i in chartype) {
    if (str.match(chartype[i][0])) {
      return chartype[i][1];
    }
  }
  return "O";
}

TinySegmenter.prototype.segment = function (input) {
  if (input == null || input == undefined || input == "") {
    return [];
  }
  var m = this.model;
  var result = [];
  var seg = ["B3", "B2", "B1"];
  var ctype = ["O", "O", "O"];
  var o = input.split("");
  for (i = 0; i < o.length; ++i) {
    seg.push(o[i]);
    ctype.push(getctype(o[i]));
  }
  seg.push("E1");
  seg.push("E2");
  seg.push("E3");
  ctype.push("O");
  ctype.push("O");
  ctype.push("O");
  var word = seg[3];
  var p1 = "U";
  var p2 = "U";
  var p3 = "U";
  for (var i = 4; i < seg.length - 3; ++i) {
    var score = m.BIAS;
    var w1 = seg[i - 3];
    var w2 = seg[i - 2];
    var w3 = seg[i - 1];
    var w4 = seg[i];
    var w5 = seg[i + 1];
    var w6 = seg[i + 2];
    var c1 = ctype[i - 3];
    var c2 = ctype[i - 2];
    var c3 = ctype[i - 1];
    var c4 = ctype[i];
    var c5 = ctype[i + 1];
    var c6 = ctype[i + 2];
    score += m.UP1[p1] || 0;
    score += m.UP2[p2] || 0;
    score += m.UP3[p3] || 0;
    score += m.BP1[p1 + p2] || 0;
    score += m.BP2[p2 + p3] || 0;
    score += m.UW1[w1] || 0;
    score += m.UW2[w2] || 0;
    score += m.UW3[w3] || 0;
    score += m.UW4[w4] || 0;
    score += m.UW5[w5] || 0;
    score += m.UW6[w6] || 0;
    score += m.BW1[w2 + w3] || 0;
    score += m.BW2[w3 + w4] || 0;
    score += m.BW3[w4 + w5] || 0;
    score += m.TW1[w1 + w2 + w3] || 0;
    score += m.TW2[w2 + w3 + w4] || 0;
    score += m.TW3[w3 + w4 + w5] || 0;
    score += m.TW4[w4 + w5 + w6] || 0;
    score += m.UC1[c1] || 0;
    score += m.UC2[c2] || 0;
    score += m.UC3[c3] || 0;
    score += m.UC4[c4] || 0;
    score += m.UC5[c5] || 0;
    score += m.UC6[c6] || 0;
    score += m.BC1[c2 + c3] || 0;
    score += m.BC2[c3 + c4] || 0;
    score += m.BC3[c4 + c5] || 0;
    score += m.TC1[c1 + c2 + c3] || 0;
    score += m.TC2[c2 + c3 + c4] || 0;
    score += m.TC3[c3 + c4 + c5] || 0;
    score += m.TC4[c4 + c5 + c6] || 0;
    score += m.UQ1[p1 + c1] || 0;
    score += m.UQ2[p2 + c2] || 0;
    score += m.UQ3[p3 + c3] || 0;
    score += m.BQ1[p2 + c2 + c3] || 0;
    score += m.BQ2[p2 + c3 + c4] || 0;
    score += m.BQ3[p3 + c2 + c3] || 0;
    score += m.BQ4[p3 + c3 + c4] || 0;
    score += m.TQ1[p2 + c1 + c2 + c3] || 0;
    score += m.TQ2[p2 + c2 + c3 + c4] || 0;
    score += m.TQ3[p3 + c1 + c2 + c3] || 0;
    score += m.TQ4[p3 + c2 + c3 + c4] || 0;
    var p = "O";
    if (score > 0) {
      result.push(word);
      word = "";
      p = "B";
    }
    p1 = p2;
    p2 = p3;
    p3 = p;
    word += seg[i];
  }
  result.push(word);
  return result;
};
